analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32675/Include/max32675.svd
<?xml version='1.0' encoding='utf-8'?>
<device xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xsi:noNamespaceSchemaLocation="svd_schema.xsd">
 <vendor>Maxim-Integrated</vendor>
 <vendorID>Maxim</vendorID>
 <name>max32675</name>
 <series>ARMCM4</series>
 <version>1.0</version>
 <description>MAX32675 32-bit ARM Cortex-M4 microcontroller, 1024KB of flash, 760KB of system RAM, 128KB of Boot ROM.</description>
 <cpu>
  <name>CM4</name>
  <revision>r2p1</revision>
  <endian>little</endian>
  <mpuPresent>true</mpuPresent>
  <fpuPresent>true</fpuPresent>
  <nvicPrioBits>3</nvicPrioBits>
  <vendorSystickConfig>false</vendorSystickConfig>
 </cpu>
 <addressUnitBits>8</addressUnitBits>
 <width>32</width>
 <size>0x20</size>
 <access>read-write</access>
 <resetValue>0x00000000</resetValue>
 <resetMask>0xFFFFFFFF</resetMask>
 <peripherals>
  <peripheral>
   <name>AESKEYS</name>
   <description>AES Key Registers.</description>
   <baseAddress>0x40007800</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>KEY0</name>
     <description>AES Key 0.</description>
     <addressOffset>0x00</addressOffset>
     <size>32</size>
    </register>
    <register>
     <name>KEY1</name>
     <description>AES Key 1.</description>
     <addressOffset>0x04</addressOffset>
     <size>32</size>
    </register>
    <register>
     <name>KEY2</name>
     <description>AES Key 2.</description>
     <addressOffset>0x08</addressOffset>
     <size>32</size>
    </register>
    <register>
     <name>KEY3</name>
     <description>AES Key 3.</description>
     <addressOffset>0x0C</addressOffset>
     <size>32</size>
    </register>
    <register>
     <name>KEY4</name>
     <description>AES Key 4.</description>
     <addressOffset>0x10</addressOffset>
     <size>32</size>
    </register>
    <register>
     <name>KEY5</name>
     <description>AES Key 5.</description>
     <addressOffset>0x14</addressOffset>
     <size>32</size>
    </register>
    <register>
     <name>KEY6</name>
     <description>AES Key 6.</description>
     <addressOffset>0x18</addressOffset>
     <size>32</size>
    </register>
    <register>
     <name>KEY7</name>
     <description>AES Key 7.</description>
     <addressOffset>0x1C</addressOffset>
     <size>32</size>
    </register>
   </registers>
  </peripheral>
<!--AESKEYS AES Key Registers.-->
  <peripheral>
   <name>AES</name>
   <description>AES Keys.</description>
   <baseAddress>0x40007400</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>CTRL</name>
     <description>AES Control Register</description>
     <addressOffset>0x0000</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>EN</name>
       <description>AES Enable</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>DMA_RX_EN</name>
       <description>DMA Request To Read Data Output FIFO</description>
       <bitRange>[1:1]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>DMA_TX_EN</name>
       <description>DMA Request To Write Data Input FIFO</description>
       <bitRange>[2:2]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>START</name>
       <description>Start AES Calculation</description>
       <bitRange>[3:3]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>INPUT_FLUSH</name>
       <description>Flush the data input FIFO</description>
       <bitRange>[4:4]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>OUTPUT_FLUSH</name>
       <description>Flush the data output FIFO</description>
       <bitRange>[5:5]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>KEY_SIZE</name>
       <description>Encryption Key Size</description>
       <bitRange>[7:6]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>AES128</name>
         <description>128 Bits.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>AES192</name>
         <description>192 Bits.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>AES256</name>
         <description>256 Bits.</description>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TYPE</name>
       <description>Encryption Type Selection</description>
       <bitRange>[9:8]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>STATUS</name>
     <description>AES Status Register</description>
     <addressOffset>0x0004</addressOffset>
     <fields>
      <field>
       <name>BUSY</name>
       <description>AES Busy Status</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>INPUT_EM</name>
       <description>Data input FIFO empty status</description>
       <bitRange>[1:1]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>INPUT_FULL</name>
       <description>Data input FIFO full status</description>
       <bitRange>[2:2]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>OUTPUT_EM</name>
       <description>Data output FIFO empty status</description>
       <bitRange>[3:3]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>OUTPUT_FULL</name>
       <description>Data output FIFO full status</description>
       <bitRange>[4:4]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INTFL</name>
     <description>AES Interrupt Flag Register</description>
     <addressOffset>0x0008</addressOffset>
     <fields>
      <field>
       <name>DONE</name>
       <description>AES Done Interrupt</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>KEY_CHANGE</name>
       <description>External AES Key Changed Interrupt</description>
       <bitRange>[1:1]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>KEY_ZERO</name>
       <description>External AES Key Zero Interrupt</description>
       <bitRange>[2:2]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>OV</name>
       <description>Data Output FIFO Overrun Interrupt</description>
       <bitRange>[3:3]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>KEY_ONE</name>
       <description>KEY_ONE</description>
       <bitRange>[4:4]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INTEN</name>
     <description>AES Interrupt Enable Register</description>
     <addressOffset>0x000C</addressOffset>
     <fields>
      <field>
       <name>DONE</name>
       <description>AES Done Interrupt Enable</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>KEY_CHANGE</name>
       <description>External AES Key Changed Interrupt Enable</description>
       <bitRange>[1:1]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>KEY_ZERO</name>
       <description>External AES Key Zero Interrupt Enable</description>
       <bitRange>[2:2]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>OV</name>
       <description>Data Output FIFO Overrun Interrupt Enable</description>
       <bitRange>[3:3]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>KEY_ONE</name>
       <description>KEY_ONE</description>
       <bitRange>[4:4]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO</name>
     <description>AES Data Register</description>
     <addressOffset>0x0010</addressOffset>
     <fields>
      <field>
       <name>DATA</name>
       <description>AES FIFO</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
